---
kind: property
id: P:Autodesk.Revit.DB.ExportLayerTableIterator.CurrentObject
source: html/a036569c-a8e1-6fc1-e194-db9cbc3bd4b5.htm
---
# Autodesk.Revit.DB.ExportLayerTableIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```